Better handshake docs
